#include<stdio.h>

int main(){

    int start_num, stop_num;

    printf("Enter start number:");
    scanf("%d", &start_num);
    printf("Enter stop number:");
    scanf("%d", &stop_num);

    for (int i = start_num; i <= stop_num; i++)
    {
        printf("%d ", i);
    }

    printf("\nThank you.");

    return 0;
    
}

/*
-------------------------------------| คำอธิบาย |------------------------------------
บรรทัดที่ 1 นำเข้าไลบารี stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน main()
บรรทัดที่ 5 ประกาศตัวแปรชนิดจำนวนเต็ม ชื่อ start_num และ stop_num
บรรทัดที่ 7 แสดงผลหน้าจอ Enter start number: เพื่อเก็บค่า start_num
บรรทัดที่ 8 เก็บค่า start_num ในรูปแบบจำนวนเต็ม
บรรทัดที่ 9 แสดงผลหน้าจอ Enter stop number: เพื่อเก็บค่า stop_num
บรรทัดที่ 10 เก็บค่า stop_num ในรูปแบบจำนวนเต็ม
บรรทัดที่ 12 ใช้คำสั่ง for loop โดยประกาศค่า i และให้มีค่าเท่ากับ start_num กำหนดเงื่อนไขการวนซ้ำ คือ
           i น้อยกว่าหรือเท่ากับ stop_num และ อัปเดตค่าตัวแปร i โดยการ+1
บรรทัดที่ 14 ให้แสดงผลหน้าจอเป็นจำนวนเต็ม โดยแสดงผลค่า i
บรรทัดที่ 17 เมื่อจบการวนซ้ำ ให้แสดงผลบนหน้าจอว่า Thank you.
บรรทัดที่ 19 คืนค่าโปรแกรมเป็น 0
------------------------------------------------------------------------------------
*/