#include<stdio.h>

int main(){

    int n = 2;

    while (n <= 10)
    {
        printf("%d ", n);
        n+=2;
    }

    printf("\nEnd of loop");

    return 0;
    
}

/*
-------------------------------------| คำอธิบาย |------------------------------------
บรรทัดที่ 1 นำเข้าไลบารี stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน main()
บรรทัดที่ 5 ประกาศกำหนดตัวแปร n = 2
บรรทัดที่ 7 ใช้คำสั่ง while loop โดยให้เงื่อนไขการวนซ้ำ คือ n น้อยกว่าหรือเท่ากับ 10 แล้วหลุดออกจาก loop
บรรทัดที่ 9 ให้แสดงผลหน้าจอเป็นจำนวนเต็ม โดยแสดงผลค่า n
บรรทัดที่ 10 เพิ่มค่า n โดยการบวก 2
บรรทัดที่ 13 เมื่อจบการวนซ้ำให้แสดงผลหน้าจอ End of loop
บรรทัดที่ 15 คืนค่าโปรแกรมเป็น 0
------------------------------------------------------------------------------------
*/