#include<stdio.h>

int main(){

    for (int n = 2; n <= 10; n+=2)
    {
        printf("%d ", n);
    }

    printf("\nEnd of loop");

    return 0;
    
}

/*
-------------------------------------| คำอธิบาย |------------------------------------
บรรทัดที่ 1 นำเข้าไลบารี stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน main()
บรรทัดที่ 5 ใช้คำสั่ง for loop โดยกำหนด initialization เป็น n = 2 กำหนดเงื่อนไข คือ n น้อยกว่า
          หรือเท่ากับ 10 และอัปเดตค่าตัวแปร n โดยการเพิ่มค่า +2
บรรทัดที่ 7 ให้แสดงผลหน้าจอเป็นจำนวนเต็ม โดยแสดงผลค่า n
บรรทัดที่ 10 เมื่อจบการวนซ้ำให้แสดงผลหน้าจอ End of loop
บรรทัดที่ 12 คืนค่าโปรแกรมเป็น 0
------------------------------------------------------------------------------------
*/